<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">

<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>Spring-Buch-Beispiel: Lies Mich</title>
<link rel="stylesheet" href="html.css" type="text/css">
</head>
<body bgcolor="white" text="black" link="#0000FF" vlink="#840084"
	alink="#0000FF">
<div class="book" lang="en">
<div class="titlepage">
<h1 class="title"><a name="d0e1"></a>Spring-Buch-Beispiel: Lies
Mich</h1>
</div>
<h2 class="title"><a name="introduction"></a>Einf&uuml;hrung</h2>
<p>Willkommen zu den Beispielanwendungen aus dem Spring-3-Buch!</p>
<p>Die Beispiele sind in verschiedenen Unterverzeichnissen
organisiert. Dadurch können Sie die Beispiel jeweils individuell
ausf&uuml;hren und mit ihnen experimentieren.</p>
<p>Viel Spa&szlig; dabei!</p>
<p><a href="mailto:eberhard.wolff@gmail.com">Eberhard
Wolff</a></p>

<h2 class="title"><a name="maven"></a>Zwei Worte zu Maven</h2>
<p>Die Beispiele basieren auf dem Build-Tool Maven. Das hat
verschiedene Vorteile:</p>
<ul>
	<li>Es m&uuml;ssen keine abh&auml;ngigen Bibliotheken installiert
	werden</li>
	<li>Es ist auch kein Application- oder Web-Server zu installieren,
	auch das wird von Maven erledigt.</li>
</ul>
<p>Zur Installation von Maven m&uuml;ssen Sie folgendes tun:</p>
<ul>
	<li>Installieren Sie maven 2.2.1 von <a
		href="http://maven.apache.org/download.html">http://maven.apache.org/download.html</a></li>
	<li>F&uuml;gen Sie das maven bin Verzeichnis in den Pfad ein.
	Kontrolle: In einer Eingabeaufforderung m&uuml;ssen Sie nun <code
		class="literal">mvn</code> ausf&uuml;hren k&ouml;nnen.</li>

</ul>
<h2 class="title"><a name="mavenprojekte"></a> Maven-Projekte</h2>
<p>Die Maven-Projekte haben ein festes Layout:</p>
<ul>
	<li>In <code class="literal">src/test</code> liegt der Anteil des
	Projekts, der f&uuml;r die Tests notwendig ist.</li>
	<li>In <code class="literal">src/main</code> liegt der Anteil des
	Projekts, der f&uuml;r die Funktionalit&auml;ten benötigt wird.</li>
</ul>
Diese beiden Verzeichnisse haben identische Unterverzeichnisse:
<ul>
	<li>In <code class="literal">java</code> liegt der Java-Code.</li>
	<li>Und in <code class="literal">resources</code> die &uuml;brigen
	Ressourcen.</li>
</ul>
<p>Meinstens haben die Projekte Tests, die die Benutzung der
Spring-Features verdeutlicht.</p>
<p>Allgemeine Einstellungen sind in dem pom.xml in diesem
Verzeichnis.</p>
<p>Sie k&ouml;nnen alle Projekt mit einem mvn install in dem
Hauptverzeichnis, in dem auch diese Datei liegt, compilieren, testen
und in Ihr lokales Maven-Repository kopieren. Dies geht auch f&uuml;r
einzelne Projekte, wenn Sie mvn install in dem Unterverzeichnis
ausf&uuml;hren.</p>
<p>Web-Anwendungen kann man mit einem mvn jetty:run in dem jeweiligen
Verzeichnis starten. Einige Projekt haben Tests in einem Package
remotetest. Diese Test setzen voraus, dass der Server l&auml;uft und
werden bei einem mvn install nicht ausgef&uuml;hrt. Sie m&uuml;ssen
also nach dem Start des Servers manuell gestartet werden.</p>
<h2 class="title"><a name="eclipse"></a>Eclipse-Projekte erzeugen</h2>
<p>Ich empfehle die Nutzung der SpringSource Tool Suite, da diese
Eclipse-Distribution schon einige wichtige Plug Ins integriert
hat. Sie k&ouml;nnen STS unter <a
href="http://www.springsource.com/products/sts">http://www.springsource.com/products/sts</a>
runterladen. Alternativ kann man ein Eclipse mit mindestens der
m2eclipse-Maven-Integration nutzen.</p>
<p>Legen Sie einen neuen Eclipse-Workspace an. Dazu kann man <code
	class="literal">File -&gt; Switch Workspace...</code> verwenden und in
dem Dialog dann ein neues Verzeichnis eingeben.</p>
<p>Anschlie&szlig;end m&uuml;ssen Sie im File-Men&uuml; den Eintrag
Import. In dem erscheinenden Dialog w&auml;hlen Sie unter General den Punkt
Maven Projects. Dann dr&uuml;cken Sie den Next-Button.
Als Root-Verzeichnis w&auml;hlen Sie das Verzeichnis mit den
ausgepackten Beispielen. Dann dr&uuml;cken Sie den Finish-Button. Der
Workspace baut sich dann auf.</p>
<p>Web-Anwendungen kann man dann in Eclipse einfach mit einem rechten Mausklick auf das Projekt starten. Dort w&auml;hlt man Run As und dann Run On Server. Man muss dann nur noch einen Server ausw&auml;hlen, auf dem die Anwendungen laufen soll.</p>
<h2 class="title"><a name="beispielanwendung"></a>beispielanwendung</h2>
<p>Dieses Projekt enthält die Basis-Funktionalitäten der
Beispielanwendung, also den Gesch&auml;ftslogik-Kern. Dazu z&auml;hlt
auch die Persistenz. Das Projekt enth&auml;lt Tests f&uuml;r die
Funktionalit&auml;ten. Dadurch kann man sehen, dass die Anwendung
tats&auml;chlich funktioniert. Die Tests werden w&auml;hrend der
Installation ausgef&uuml;hrt. Durch die Installation steht der
Gesch&auml;ftslogik-Kern den andern Beispielen zur Verf&uuml;gung.</p>

<h2 class="title"><a
name="beispielanwendung-annotations"></a>beispielanwendung-annotations</h2>
<p>
Im Prinzip wie die Beispielanwendung - aber mit Annotationen statt
XML-Konfiguration. 
</p>

<h2 class="title"><a
name="beispielanwendung-jsr330"></a>beispielanwendung-jsr330</h2>
<p>
Im Prinzip wie die Beispielanwendung - aber mit JSR330-Annotationen statt
XML-Konfiguration.
</p>

<h2 class="title"><a
name="beispielanwendung3"></a>beispielanwendung3</h2>
<p> Eine vollst&auml;ndige Spring-3-Anwendung zum Beispiel mit REST.
</p>

<h2 class="title"><a
name="el"></a>el</h2>
<p>
Einige Beispiele f&uuml;r die Spring Expression Language (SpEL).
</p>


<h2 class="title"><a name="web"></a>web</h2>

<p>Das Web-Projekt ist ein Web-Frontend auf Basis von Spring MVC.
Damit dieses Projekt funktioniert, muss vorher die Beispielanwendung
installiert worden sein. Es kann dann mit jetty:run gestartet werden. Die URL ist dann <a href="http://localhost:8080/web">http://localhost:8080/web</a>.

<h2 class="title"><a name="jsf"></a>jsf</h2>

<p>Das JSF-Projekt ist ein Web-Frontend auf Basis von JSF mit
Integration in Spring. Damit dieses Projekt funktioniert, muss vorher
die Beispielanwendung installiert worden sein.  Es kann dann mit jetty:run gestartet werden. </p>
Die URL ist dann <a href="http://localhost:8080/jsf">http://localhost:8080/jsf</a>.

<h2 class="title"><a name="springsecurity"></a>springsecurity</h2>

<p>Das Spring-Security-Beispiel setzt auf dem Web-Beispiel auf.  Das
Spring-Security-Projekt l&auml;dt das Web-Projekt und erg&auml;nzt es um den
Sicherheits-Aspekt mit Hilfe von Spring Security.</p>
<p>Man kann es dann mit <code class="literal">mvn
jetty:run</code> starten.</p>
</p>
<p>Die Anwendung steht dann unter der URL <a
	href="http://localhost:8080/acegi/">http://localhost:8080/acegi/</a>
zur Verf&uuml;gung.</p>
<p>Leider unterst&uuml;tzt die Maven-Eclipse-Integration die
Erg&auml;nzung von Web-Anwendungen nicht, man kann die Anwendung in
Eclipse also nicht starten.</p>

<h2 class="title"><a name="webflow"></a>webflow</h2>

<p>Dieses Projekt benutzt Spring Web Flow zum Aufbaue eines etwas
komplexeren Bestell-Prozesses. Man kann es mit <code class="literal">jetty:run</code>
starten. </p>
<p>Die Anwendung steht dann unter der URL <a
	href="http://localhost:8080/webflow/">http://localhost:8080/webflow/</a>
zur Verf&uuml;gung.</p>

<h2 class="title"><a name="remoting"></a>remoting</h2>

<p>Das Remoting-Projekt zeigt die Remoting-Technologien aus Spring.
Dabei wird Hession, Burlap und der HttpInvoker von Spring
gezeigt. Dazu muss die Beispielanwendung im Maven-Repository installiert
sein. Dann muss man den Web-Server mit <code class="literal">mvn
jetty:run</code> starten. Dann kann man
auch die Tests aus dem Package remotetest ausf&uuml;hren.</p>
</p>

<h2 class="title"><a name="webservice"></a>webservice</h2>

<p>Dieses Projekt nutzt Spring Web Services f&uuml;r die
Implementierung eines Web Service. Man kann den Web Service mit <code
	class="literal">mvn jetty:run</code> starten. Dann kann man
auch die Tests aus dem Package remotetest ausf&uuml;hren.</p>

<h2 class="title"><a name="webservice-annnotations"></a>webservice-annotations</h2>

<p>Wie webservice - allerdings werden hier Annotationen f&uuml;r die
Implementierung der Web Services genutzt.</p>


<h2 class="title"><a name="enterprise"></a>Enterprise</h2>

<p>Dieses Projekt zeigt die Verwendung der Enterprise-Features wie
JMS, Timer und JMX. JMS und Timer werden durch <code class="literal">mvn
test</code> laufen gelassen. Bei JMX muss man mit <code class="literal">mvn
exec:exec</code> die Anwendung starten. Anschließend kann man die <code
	class="literal">jconsole</code> die JDK-Management-Console starten und
sich die JMX-Beans anschauen. Sie &auml;ndern auch regelm&auml;&szlig;ig
ihre Werte.</p>

<h2 class="title"><a name="aop2"></a>aop2</h2>

<p>In diesem Projekt werden die AOP-Features von Spring 2 gezeigt.
Dazu sind entsprechende Tests vorhanden, die man mit <code
	class="literal">mvn test</code> ausprobieren kann.</p>

<h2 class="title"><a name="beispiele"></a>beispiele</h2>

<p>In diesem Projekt werden verschiedene kleiner Beispiele mit
Spring gezeigt. Dazu sind entsprechende Tests vorhanden, die man mit <code
	class="literal">mvn test</code> ausprobieren kann.</p>

<h2 class="title"><a name="aop-benchmark"></a>aop-benchmark</h2>

<p>Dieses Projekt enth&auml;lt den Code f&uuml;r den AOP-Benchmark. Er
	wird mit <code
	class="literal">mvn test</code> gestartet.</p>


<h2 class="title"><a name="feedback"></a>Feedback</h2>
<p>Feedback bitte an <a
	href="mailto:eberhard.wolff@gmail.com">Eberhard Wolff</a>.</p>
</body>
</html>
